#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.trend-getter-key: Refreshing state... [id=a47ca5ce69932d82542644f179386827027c4e11]
data.aws_iam_policy_document.lambda_permissions: Reading...
aws_key_pair.trend-getter-ec2-key: Refreshing state... [id=c18-trend-getter-kp]
data.aws_iam_policy_document.lambda_permissions_notif: Reading...
data.aws_subnet.public_3: Reading...
aws_ecr_repository.trend-getter-extract-and-load-ecr: Refreshing state... [id=trend-getter-extract-and-load-ecr]
data.aws_subnet.public_1: Reading...
data.aws_iam_policy_document.lambda_role: Reading...
data.aws_subnet.public_2: Reading...
aws_ecr_repository.c18-trend-getter-notifications-ecr: Refreshing state... [id=c18-trend-getter-notifications-ecr]
aws_s3_bucket.c18-trend-getter-s3: Refreshing state... [id=c18-trend-getter-s3]
data.aws_iam_policy_document.lambda_role: Read complete after 0s [id=3744218410]
data.aws_iam_policy_document.lambda_permissions_notif: Read complete after 0s [id=2124571330]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=4056015528]
data.aws_iam_policy_document.lambda_role_notif: Reading...
data.aws_vpc.main: Reading...
data.aws_iam_policy_document.lambda_role_notif: Read complete after 0s [id=2690255455]
aws_ecr_repository.trend-getter-lambda-ecr: Refreshing state... [id=trend-getter-lambda-ecr]
aws_iam_role.lambda_role: Refreshing state... [id=c18-data-getter-lambda-role]
aws_iam_policy.lambda_s3_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
aws_iam_role.lambda_role_notif: Refreshing state... [id=c18-data-getter-notif-lambda-role]
data.aws_subnet.public_2: Read complete after 1s [id=subnet-0f10662561eade8c3]
data.aws_subnet.public_3: Read complete after 1s [id=subnet-0aed07ac008a10da9]
aws_lambda_function.lambda_function: Refreshing state... [id=c18-trend-getter-lambda-function]
data.aws_subnet.public_1: Read complete after 1s [id=subnet-0679d4b1f9e7839ef]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=c18-trend-getter-rds-subnet-group]
aws_iam_role_policy_attachment.lambda_s3_attach: Refreshing state... [id=c18-data-getter-lambda-role/arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
data.aws_vpc.main: Read complete after 2s [id=vpc-0adcb6a62ca552c01]
aws_security_group.rds_sg: Refreshing state... [id=sg-0699c97d0de8afddc]
aws_security_group.trend-getter-ec2-sg: Refreshing state... [id=sg-0ec95d6742c91e9bb]
aws_scheduler_schedule.S3-to-RDS-ETL: Refreshing state... [id=default/c18-trend-getter-S3-to-RDS-ETL-eb]
aws_db_instance.postgresql: Refreshing state... [id=db-UU2R632XBCS7PYO2UOF2LKE3AE]
aws_instance.ec2: Refreshing state... [id=i-034fe5b94adc3d579]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.lambda_s3_policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3_policy" {
        id               = "arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy"
        name             = "c18-data-getter-lambda-s3-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:*:*:*"
                    },
                  ~ {
                      ~ Action   = "lambda:InvokeFunction" -> [
                          + "xray:GetTraceSummaries",
                          + "xray:BatchGetTraces",
                          + "tag:GetResources",
                          + "states:ListStateMachines",
                          + "states:DescribeStateMachine",
                          + "logs:DescribeLogGroups",
                          + "lambda:InvokeFunction",
                          + "lambda:*",
                          + "kms:ListAliases",
                          + "iam:ListRoles",
                          + "iam:ListRolePolicies",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "iam:GetPolicyVersion",
                          + "iam:GetPolicy",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricData",
                          + "cloudformation:ListStackResources",
                          + "cloudformation:DescribeStacks",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.lambda_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "xray:GetTraceSummaries",
                          + "xray:BatchGetTraces",
                          + "tag:GetResources",
                          + "sts:AssumeRole",
                          + "states:ListStateMachines",
                          + "states:DescribeStateMachine",
                          + "logs:DescribeLogGroups",
                          + "lambda:InvokeFunction",
                          + "lambda:*",
                          + "kms:ListAliases",
                          + "iam:ListRoles",
                          + "iam:ListRolePolicies",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "iam:GetPolicyVersion",
                          + "iam:GetPolicy",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricData",
                          + "cloudformation:ListStackResources",
                          + "cloudformation:DescribeStacks",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "c18-data-getter-lambda-role"
        name                  = "c18-data-getter-lambda-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "c18-trend-getter-lambda-function"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "AWS_ACCESS_KEY_ID"     = (sensitive value)
              + "AWS_DEFAULT_REGION"    = (sensitive value)
              + "AWS_SECRET_ACCESS_KEY" = (sensitive value)
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda_function_notif will be created
  + resource "aws_lambda_function" "lambda_function_notif" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-trend-getter-notifications-function"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-trend-getter-notifications-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 7168
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::129033205317:role/c18-data-getter-lambda-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = null
              + "DB_NAME"     = null
              + "DB_PASSWORD" = (sensitive value)
              + "DB_PORT"     = null
              + "DB_SCHEMA"   = "bluesky"
              + "DB_USER"     = "trendgetter"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @jacoblewis046, Action: `pull_request`*